tutorials/3DDeform/FT3DDeform/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-05;
            relTol          0;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

        tolerance       1e-05;
        relTol          0;
        //maxIter         100;
		//minimize unnecessary computations
		maxIter         1;
		nSweeps         1;  
		nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
    }

    pcorrFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-05;
            relTol          0;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

        tolerance       1e-05;
        relTol          0;
        //maxIter         100;
		//minimize unnecessary computations
		maxIter         1;
		nSweeps         1;  
		nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
		//minimize unnecessary computations
		maxIter         1;
		nSweeps         1;  
		nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       2e-09;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

        tolerance       2e-09;
        relTol          0;
        //maxIter         20;
		//minimize unnecessary computations
		maxIter         1;
		nSweeps         1;  
		nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
        nSweeps         1;
		//minimize unnecessary computations
		maxIter         1;
		nSweeps         1;  
		nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
    }

    "(U)Final"
    {
        $U;
        relTol          0;
    }

    densityIndicator
    {
        /*
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-09;
        relTol          1e-09;
        */
        
        /*
        solver          PCG;//ICCG,PCG
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          1e-3;
        */
        
        solver           GAMG;
        tolerance        1e-12;//1e-12;
        relTol           1e-12;//1e-6;

        smoother         nonBlockingGaussSeidel;//DIC,DICGaussSeidel,FDIC,GaussSeidel,nonBlockingGaussSeidel,symGaussSeidel

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

	"(densityIndicator)Final"
    {
        $densityIndicator;
        relTol          0;
    }

    viscosityIndicator
    {
        solver          ICCG;//ICCG,PCG
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          1e-12;

        /*
        solver           GAMG;
        tolerance        1e-12;//1e-12;
        relTol           1e-12;//1e-6;

        smoother         nonBlockingGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        */
    }

	"(viscosityIndicator)Final"
    {
        $viscosityIndicator;
        relTol          0;
    }

    indicator
    {

        solver          PCG;//ICCG,PCG
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          1e-3;

        /*
        solver           GAMG;
        tolerance        1e-12;//1e-12;
        relTol           1e-12;//1e-6;

        smoother         nonBlockingGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        */
    }

	"(indicator)Final"
    {
        $indicator;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     0; //3
    nNonOrthogonalCorrectors 0;
    pRefCell        1;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}
// ************************************************************************* //
